Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_srq.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_srq.c
 *    Mcxnex Shared Receive Queue Processing Routines
 *
 *    Implements all the routines necessary for allocating, freeing, querying,
 *    modifying and posting shared receive queues.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/bitmap.h>

#include "mcxnex.h"

static void mcxnex_srq_sgl_to_logwqesz(mcxnex_state_t *state, uint_t num_sgl,
    mcxnex_qp_wq_type_t wq_type, uint_t *logwqesz, uint_t *max_sgl);

/*
 * mcxnex_srq_alloc()
 *    Context: Can be called only from user or kernel context.
 */
int
mcxnex_srq_alloc(mcxnex_state_t *state, mcxnex_srq_info_t *srqinfo,
    uint_t sleepflag)
{
	ibt_srq_hdl_t		ibt_srqhdl;
	mcxnex_pdhdl_t		pd;
	ibt_srq_sizes_t		*sizes;
	ibt_srq_sizes_t		*real_sizes;
	mcxnex_srqhdl_t		*srqhdl;
	ibt_srq_flags_t		flags;
	mcxnex_rsrc_t		*srqc, *rsrc;
	mcxnex_hw_srqc_t	srqc_entry;
	uint32_t		*buf;
	mcxnex_srqhdl_t		srq;
	mcxnex_umap_db_entry_t	*umapdb;
	ibt_mr_attr_t		mr_attr;
	mcxnex_mr_options_t	mr_op;
	mcxnex_mrhdl_t		mr;
	uint64_t		value, srq_desc_off;
	uint32_t		log_srq_size;
	uint32_t		uarpg;
	uint_t			srq_is_umap;
	int			flag, status;
	uint_t			max_sgl;
	uint_t			wqesz;
	uint_t			srq_wr_sz;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*sizes))

	/*
	 * options-->wq_location used to be for location, now explicitly
	 * LOCATION_NORMAL
	 */

	/*
	 * Extract the necessary info from the mcxnex_srq_info_t structure
	 */
	real_sizes = srqinfo->srqi_real_sizes;
	sizes	   = srqinfo->srqi_sizes;
	pd	   = srqinfo->srqi_pd;
	ibt_srqhdl = srqinfo->srqi_ibt_srqhdl;
	flags	   = srqinfo->srqi_flags;
	srqhdl	   = srqinfo->srqi_srqhdl;

	/*
	 * Determine whether SRQ is being allocated for userland access or
	 * whether it is being allocated for kernel access.  If the SRQ is
	 * being allocated for userland access, then lookup the UAR doorbell
	 * page number for the current process.  Note:  If this is not found
	 * (e.g. if the process has not previously open()'d the Mcxnex driver),
	 * then an error is returned.
	 */
	srq_is_umap = (flags & IBT_SRQ_USER_MAP) ? 1 : 0;
	if (srq_is_umap) {
		status = mcxnex_umap_db_find(state->hs_instance, ddi_get_pid(),
		    MLNX_UMAP_UARPG_RSRC, &value, 0, NULL);
		if (status != DDI_SUCCESS) {
			status = IBT_INVALID_PARAM;
			goto srqalloc_fail3;
		}
		uarpg = ((mcxnex_rsrc_t *)(uintptr_t)value)->hr_indx;
	} else {
		uarpg = state->hs_kernel_uar_index;
	}

	/* Increase PD refcnt */
	mcxnex_pd_refcnt_inc(pd);

	/* Allocate an SRQ context entry */
	status = mcxnex_rsrc_alloc(state, MCXNEX_SRQC, 1, sleepflag, &srqc);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto srqalloc_fail1;
	}

	/* Allocate the SRQ Handle entry */
	status = mcxnex_rsrc_alloc(state, MCXNEX_SRQHDL, 1, sleepflag, &rsrc);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto srqalloc_fail2;
	}

	srq = (mcxnex_srqhdl_t)rsrc->hr_addr;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*srq))

	bzero(srq, sizeof (struct mcxnex_sw_srq_s));
	/* Calculate the SRQ number */

	/* just use the index, implicit in Mcxnex */
	srq->srq_srqnum = srqc->hr_indx;

	/*
	 * If this will be a user-mappable SRQ, then allocate an entry for
	 * the "userland resources database".  This will later be added to
	 * the database (after all further SRQ operations are successful).
	 * If we fail here, we must undo the reference counts and the
	 * previous resource allocation.
	 */
	if (srq_is_umap) {
		umapdb = mcxnex_umap_db_alloc(state->hs_instance,
		    srq->srq_srqnum, MLNX_UMAP_SRQMEM_RSRC,
		    (uint64_t)(uintptr_t)rsrc);
		if (umapdb == NULL) {
			status = IBT_INSUFF_RESOURCE;
			goto srqalloc_fail3;
		}
	}

	/*
	 * Allocate the doorbell record.  Mcxnex just needs one for the
	 * SRQ, and use uarpg (above) as the uar index
	 */

	status = mcxnex_dbr_alloc(state, uarpg, &srq->srq_wq_dbr_acchdl,
	    &srq->srq_wq_vdbr, &srq->srq_wq_pdbr, &srq->srq_rdbr_mapoffset);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto srqalloc_fail4;
	}

	/*
	 * Calculate the appropriate size for the SRQ.
	 * Note:  All Mcxnex SRQs must be a power-of-2 in size.  Also
	 * they may not be any smaller than MCXNEX_SRQ_MIN_SIZE.  This step
	 * is to round the requested size up to the next highest power-of-2
	 */
	srq_wr_sz = max(sizes->srq_wr_sz + 1, MCXNEX_SRQ_MIN_SIZE);
	log_srq_size = highbit(srq_wr_sz);
	if ((srq_wr_sz & (srq_wr_sz - 1)) == 0) {
		log_srq_size = log_srq_size - 1;
	}

	/*
	 * Next we verify that the rounded-up size is valid (i.e. consistent
	 * with the device limits and/or software-configured limits).  If not,
	 * then obviously we have a lot of cleanup to do before returning.
	 */
	if (log_srq_size > state->hs_cfg_profile->cp_log_max_srq_sz) {
		status = IBT_HCA_WR_EXCEEDED;
		goto srqalloc_fail4a;
	}

	/*
	 * Next we verify that the requested number of SGL is valid (i.e.
	 * consistent with the device limits and/or software-configured
	 * limits).  If not, then obviously the same cleanup needs to be done.
	 */
	max_sgl = state->hs_ibtfinfo.hca_attr->hca_max_srq_sgl;
	if (sizes->srq_sgl_sz > max_sgl) {
		status = IBT_HCA_SGL_EXCEEDED;
		goto srqalloc_fail4a;
	}

