Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_srq.c
	/*
	 * Write the SRQC entry to hardware.  Lastly, we pass ownership of
	 * the entry to the hardware (using the Mcxnex SW2HW_SRQ firmware
	 * command).  Note: In general, this operation shouldn't fail.  But
	 * if it does, we have to undo everything we've done above before
	 * returning error.
	 */
	status = mcxnex_cmn_ownership_cmd_post(state, SW2HW_SRQ, &srqc_entry,
	    sizeof (mcxnex_hw_srqc_t), srq->srq_srqnum,
	    sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_CONT, "Mcxnex: SW2HW_SRQ command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		status = DDI_FAILURE;
		goto srqalloc_fail8;
	}

	/*
	 * Fill in the rest of the Mcxnex SRQ handle.  We can update
	 * the following fields for use in further operations on the SRQ.
	 */
	srq->srq_srqcrsrcp = srqc;
	srq->srq_rsrcp	   = rsrc;
	srq->srq_mrhdl	   = mr;
	srq->srq_refcnt	   = 0;
	srq->srq_is_umap   = srq_is_umap;
	srq->srq_uarpg	   = uarpg;
	srq->srq_umap_dhp  = (devmap_cookie_t)NULL;
	srq->srq_pdhdl	   = pd;
	srq->srq_wq_bufsz  = (1 << log_srq_size);
	srq->srq_wq_buf	   = buf;
	srq->srq_desc_off  = srq_desc_off;
	srq->srq_hdlrarg   = (void *)ibt_srqhdl;
	srq->srq_state	   = 0;
	srq->srq_real_sizes.srq_wr_sz = (1 << log_srq_size);
	srq->srq_real_sizes.srq_sgl_sz = srq->srq_wq_sgl;

	/*
	 * Put SRQ handle in Mcxnex SRQNum-to-SRQhdl list.  Then fill in the
	 * "srqhdl" and return success
	 */
	ASSERT(state->hs_srqhdl[srqc->hr_indx] == NULL);
	state->hs_srqhdl[srqc->hr_indx] = srq;

	/*
	 * If this is a user-mappable SRQ, then we need to insert the
	 * previously allocated entry into the "userland resources database".
	 * This will allow for later lookup during devmap() (i.e. mmap())
	 * calls.
	 */
	if (srq->srq_is_umap) {
		mcxnex_umap_db_add(umapdb);
	} else {	/* initialize work queue for kernel SRQs */
		int i, len, last;
		uint16_t *desc;

		desc = (uint16_t *)buf;
		len = wqesz / sizeof (*desc);
		last = srq->srq_wq_bufsz - 1;
		for (i = 0; i < last; i++) {
			desc[1] = htons(i + 1);
			desc += len;
		}
		srq->srq_wq_wqhdr->wq_tail = last;
		srq->srq_wq_wqhdr->wq_head = 0;
	}

	*srqhdl = srq;

	return (status);

/*
 * The following is cleanup for all possible failure cases in this routine
 */
srqalloc_fail8:
	mcxnex_wrid_wqhdr_destroy(srq->srq_wq_wqhdr);
srqalloc_fail7:
	if (mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    MCXNEX_SLEEPFLAG_FOR_CONTEXT()) != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister SRQ memory");
	}
srqalloc_fail5:
	mcxnex_queue_free(&srq->srq_wqinfo);
srqalloc_fail4a:
	mcxnex_dbr_free(state, uarpg, srq->srq_wq_vdbr);
srqalloc_fail4:
	if (srq_is_umap) {
		mcxnex_umap_db_free(umapdb);
	}
srqalloc_fail3:
	mcxnex_rsrc_free(state, &rsrc);
srqalloc_fail2:
	mcxnex_rsrc_free(state, &srqc);
srqalloc_fail1:
	mcxnex_pd_refcnt_dec(pd);
srqalloc_fail:
	return (status);
}


/*
 * mcxnex_srq_free()
 *    Context: Can be called only from user or kernel context.
 */
/* ARGSUSED */
int
mcxnex_srq_free(mcxnex_state_t *state, mcxnex_srqhdl_t *srqhdl,
    uint_t sleepflag)
{
	mcxnex_rsrc_t		*srqc, *rsrc;
	mcxnex_umap_db_entry_t	*umapdb;
	uint64_t		value;
	mcxnex_srqhdl_t		srq;
	mcxnex_mrhdl_t		mr;
	mcxnex_pdhdl_t		pd;
	mcxnex_hw_srqc_t	srqc_entry;
	uint32_t		srqnum;
	uint_t			maxprot;
	int			status;

	/*
	 * Pull all the necessary information from the Mcxnex Shared Receive
	 * Queue handle.  This is necessary here because the resource for the
	 * SRQ handle is going to be freed up as part of this operation.
	 */
	srq	= *srqhdl;
	mutex_enter(&srq->srq_lock);
	srqc	= srq->srq_srqcrsrcp;
	rsrc	= srq->srq_rsrcp;
	pd	= srq->srq_pdhdl;
	mr	= srq->srq_mrhdl;
	srqnum	= srq->srq_srqnum;

	/*
	 * If there are work queues still associated with the SRQ, then return
	 * an error.  Otherwise, we will be holding the SRQ lock.
	 */
	if (srq->srq_refcnt != 0) {
		mutex_exit(&srq->srq_lock);
		return (IBT_SRQ_IN_USE);
	}

	/*
	 * If this was a user-mappable SRQ, then we need to remove its entry
	 * from the "userland resources database".  If it is also currently
	 * mmap()'d out to a user process, then we need to call
	 * devmap_devmem_remap() to remap the SRQ memory to an invalid mapping.
	 * We also need to invalidate the SRQ tracking information for the
	 * user mapping.
	 */
	if (srq->srq_is_umap) {
		status = mcxnex_umap_db_find(state->hs_instance,
		    srq->srq_srqnum, MLNX_UMAP_SRQMEM_RSRC, &value,
		    MCXNEX_UMAP_DB_REMOVE, &umapdb);
		if (status != DDI_SUCCESS) {
			mutex_exit(&srq->srq_lock);
			MCXNEX_WARNING(state, "failed to find in database");
			return (DDI_FAILURE);
		}
		mcxnex_umap_db_free(umapdb);
		if (srq->srq_umap_dhp != NULL) {
			maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
			status = devmap_devmem_remap(srq->srq_umap_dhp,
			    state->hs_dip, 0, 0, srq->srq_wqinfo.qa_size,
			    maxprot, DEVMAP_MAPPING_INVALID, NULL);
			if (status != DDI_SUCCESS) {
				mutex_exit(&srq->srq_lock);
				MCXNEX_WARNING(state, "failed in SRQ memory "
				    "devmap_devmem_remap()");
				return (DDI_FAILURE);
			}
			srq->srq_umap_dhp = (devmap_cookie_t)NULL;
		}
	}

	/*
	 * Put NULL into the Mcxnex SRQNum-to-SRQHdl list.  This will allow any
	 * in-progress events to detect that the SRQ corresponding to this
	 * number has been freed.
	 */
	state->hs_srqhdl[srqc->hr_indx] = NULL;

	mutex_exit(&srq->srq_lock);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*srq));

	/*
	 * Reclaim SRQC entry from hardware (using the Mcxnex HW2SW_SRQ
	 * firmware command).  If the ownership transfer fails for any reason,
	 * then it is an indication that something (either in HW or SW) has
	 * gone seriously wrong.
	 */
	status = mcxnex_cmn_ownership_cmd_post(state, HW2SW_SRQ, &srqc_entry,
	    sizeof (mcxnex_hw_srqc_t), srqnum, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "failed to reclaim SRQC ownership");
		cmn_err(CE_CONT, "Mcxnex: HW2SW_SRQ command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

