Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_srq.c
	/*
	 * Deregister the memory for the Shared Receive Queue.  If this fails
	 * for any reason, then it is an indication that something (either
	 * in HW or SW) has gone seriously wrong.  So we print a warning
	 * message and return.
	 */
	status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    sleepflag);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister SRQ memory");
		return (IBT_FAILURE);
	}

	mcxnex_wrid_wqhdr_destroy(srq->srq_wq_wqhdr);

	/* Free the memory for the SRQ */
	mcxnex_queue_free(&srq->srq_wqinfo);

	/* Free the dbr */
	mcxnex_dbr_free(state, srq->srq_uarpg, srq->srq_wq_vdbr);

	/* Free the Mcxnex SRQ Handle */
	mcxnex_rsrc_free(state, &rsrc);

	/* Free the SRQC entry resource */
	mcxnex_rsrc_free(state, &srqc);

	/* Decrement the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_dec(pd);

	/* Set the srqhdl pointer to NULL and return success */
	*srqhdl = NULL;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_srq_modify()
 *    Context: Can be called only from user or kernel context.
 */
int
mcxnex_srq_modify(mcxnex_state_t *state, mcxnex_srqhdl_t srq, uint_t size,
    uint_t *real_size, uint_t sleepflag)
{
	mcxnex_qalloc_info_t	new_srqinfo, old_srqinfo;
	mcxnex_rsrc_t		*mtt, *old_mtt;
	mcxnex_bind_info_t	bind;
	mcxnex_bind_info_t	old_bind;
	mcxnex_mrhdl_t		mr;
	mcxnex_hw_srqc_t	srqc_entry;
	mcxnex_hw_dmpt_t	mpt_entry;
	uint64_t		*wre_new, *wre_old;
	uint64_t		mtt_addr;
	uint64_t		srq_pgoffs;
	uint64_t		srq_desc_off;
	uint32_t		*buf, srq_old_bufsz;
	uint32_t		wqesz;
	uint_t			max_srq_size;
	uint_t			mtt_pgsize_bits;
	uint_t			log_srq_size, maxprot;
	int			status;

	if ((state->hs_devlim.mod_wr_srq == 0) ||
	    (state->hs_cfg_profile->cp_srq_resize_enabled == 0))
		return (IBT_NOT_SUPPORTED);

	/*
	 * If size requested is larger than device capability, return
	 * Insufficient Resources
	 */
	max_srq_size = (1 << state->hs_cfg_profile->cp_log_max_srq_sz);
	if (size > max_srq_size) {
		return (IBT_HCA_WR_EXCEEDED);
	}

	/*
	 * Calculate the appropriate size for the SRQ.
	 * Note:  All Mcxnex SRQs must be a power-of-2 in size.  Also
	 * they may not be any smaller than MCXNEX_SRQ_MIN_SIZE.  This step
	 * is to round the requested size up to the next highest power-of-2
	 */
	size = max(size, MCXNEX_SRQ_MIN_SIZE);
	log_srq_size = highbit(size);
	if ((size & (size - 1)) == 0) {
		log_srq_size = log_srq_size - 1;
	}

	/*
	 * Next we verify that the rounded-up size is valid (i.e. consistent
	 * with the device limits and/or software-configured limits).
	 */
	if (log_srq_size > state->hs_cfg_profile->cp_log_max_srq_sz) {
		status = IBT_HCA_WR_EXCEEDED;
		goto srqmodify_fail;
	}

	/*
	 * Allocate the memory for newly resized Shared Receive Queue.
	 *
	 * Note: If SRQ is not user-mappable, then it may come from either
	 * kernel system memory or from HCA-attached local DDR memory.
	 *
	 * Note2: We align this queue on a pagesize boundary.  This is required
	 * to make sure that all the resulting IB addresses will start at 0,
	 * for a zero-based queue.  By making sure we are aligned on at least a
	 * page, any offset we use into our queue will be the same as it was
	 * when we allocated it at mcxnex_srq_alloc() time.
	 */
	wqesz = (1 << srq->srq_wq_log_wqesz);
	new_srqinfo.qa_size = (1 << log_srq_size) * wqesz;
	new_srqinfo.qa_alloc_align = PAGESIZE;
	new_srqinfo.qa_bind_align  = PAGESIZE;
	if (srq->srq_is_umap) {
		new_srqinfo.qa_location = MCXNEX_QUEUE_LOCATION_USERLAND;
	} else {
		new_srqinfo.qa_location = MCXNEX_QUEUE_LOCATION_NORMAL;
	}
	status = mcxnex_queue_alloc(state, &new_srqinfo, sleepflag);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto srqmodify_fail;
	}
	buf = (uint32_t *)new_srqinfo.qa_buf_aligned;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*buf))

	/*
	 * Allocate the memory for the new WRE list.  This will be used later
	 * when we resize the wridlist based on the new SRQ size.
	 */
	wre_new = kmem_zalloc((1 << log_srq_size) * sizeof (uint64_t),
	    sleepflag);
	if (wre_new == NULL) {
		status = IBT_INSUFF_RESOURCE;
		goto srqmodify_fail;
	}

	/*
	 * Fill in the "bind" struct.  This struct provides the majority
	 * of the information that will be used to distinguish between an
	 * "addr" binding (as is the case here) and a "buf" binding (see
	 * below).  The "bind" struct is later passed to mcxnex_mr_mem_bind()
	 * which does most of the "heavy lifting" for the Mcxnex memory
	 * registration routines.
	 */
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(bind))
	bzero(&bind, sizeof (mcxnex_bind_info_t));
	bind.bi_type  = MCXNEX_BINDHDL_VADDR;
	bind.bi_addr  = (uint64_t)(uintptr_t)buf;
	bind.bi_len   = new_srqinfo.qa_size;
	bind.bi_as    = NULL;
	bind.bi_flags = sleepflag == DDI_SLEEP ? IBT_MR_SLEEP :
	    IBT_MR_NOSLEEP | IBT_MR_ENABLE_LOCAL_WRITE;
	bind.bi_bypass = state->hs_cfg_profile->cp_iommu_bypass;

	status = mcxnex_mr_mtt_bind(state, &bind, new_srqinfo.qa_dmahdl, &mtt,
	    &mtt_pgsize_bits, 0); /* no relaxed ordering */
	if (status != DDI_SUCCESS) {
		status = status;
		kmem_free(wre_new, (1 << log_srq_size) *
		    sizeof (uint64_t));
		mcxnex_queue_free(&new_srqinfo);
		goto srqmodify_fail;
	}

	/*
	 * Calculate the offset between the kernel virtual address space
	 * and the IB virtual address space.  This will be used when
	 * posting work requests to properly initialize each WQE.
	 *
	 * Note: bind addr is zero-based (from alloc) so we calculate the
	 * correct new offset here.
	 */
	bind.bi_addr = bind.bi_addr & ((1 << mtt_pgsize_bits) - 1);
	srq_desc_off = (uint64_t)(uintptr_t)new_srqinfo.qa_buf_aligned -
	    (uint64_t)bind.bi_addr;
	srq_pgoffs   = (uint_t)
	    ((uintptr_t)new_srqinfo.qa_buf_aligned & MCXNEX_PAGEMASK);

	/*
	 * Fill in the MPT entry.  This is the final step before passing
	 * ownership of the MPT entry to the Mcxnex hardware.  We use all of
	 * the information collected/calculated above to fill in the
	 * requisite portions of the MPT.
	 */
	bzero(&mpt_entry, sizeof (mcxnex_hw_dmpt_t));
	mpt_entry.reg_win_len	= bind.bi_len;
	mtt_addr = (mtt->hr_indx << MCXNEX_MTT_SIZE_SHIFT);
	mpt_entry.mtt_addr_h = mtt_addr >> 32;
	mpt_entry.mtt_addr_l = mtt_addr >> 3;

