Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_srq.c
	/*
	 * for mcxnex we build up a new srqc and pass that (partially filled
	 * to resize SRQ instead of modifying the (d)mpt directly
	 */



	/*
	 * Now we grab the SRQ lock.  Since we will be updating the actual
	 * SRQ location and the producer/consumer indexes, we should hold
	 * the lock.
	 *
	 * We do a DDI_NOSLEEP here (and below), though, because we are
	 * holding the "srq_lock" and if we got raised to interrupt level
	 * by priority inversion, we would not want to block in this routine
	 * waiting for success.
	 */
	mutex_enter(&srq->srq_lock);

	/*
	 * Copy old entries to new buffer
	 */
	srq_old_bufsz = srq->srq_wq_bufsz;
	bcopy(srq->srq_wq_buf, buf, srq_old_bufsz * wqesz);

	/* Sync entire "new" SRQ for use by hardware (if necessary) */
	(void) ddi_dma_sync(bind.bi_dmahdl, 0, new_srqinfo.qa_size,
	    DDI_DMA_SYNC_FORDEV);

	/*
	 * Setup MPT information for use in the MODIFY_MPT command
	 */
	mr = srq->srq_mrhdl;
	mutex_enter(&mr->mr_lock);

	/*
	 * now, setup the srqc information needed for resize - limit the
	 * values, but use the same structure as the srqc
	 */

	srqc_entry.log_srq_size	  = log_srq_size;
	srqc_entry.page_offs	  = srq_pgoffs >> 6;
	srqc_entry.log2_pgsz	  = mr->mr_log2_pgsz;
	srqc_entry.mtt_base_addrl = (uint64_t)mtt_addr >> 32;
	srqc_entry.mtt_base_addrh = mtt_addr >> 3;

	/*
	 * RESIZE_SRQ
	 *
	 * If this fails for any reason, then it is an indication that
	 * something (either in HW or SW) has gone seriously wrong.  So we
	 * print a warning message and return.
	 */
	status = mcxnex_resize_srq_cmd_post(state, &srqc_entry,
	    srq->srq_srqnum, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_CONT, "Mcxnex: RESIZE_SRQ command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		(void) mcxnex_mr_mtt_unbind(state, &bind, mtt);
		kmem_free(wre_new, (1 << log_srq_size) *
		    sizeof (uint64_t));
		mcxnex_queue_free(&new_srqinfo);
		mutex_exit(&mr->mr_lock);
		mutex_exit(&srq->srq_lock);
		return (DDI_FAILURE);
	}
	/*
	 * Update the Mcxnex Shared Receive Queue handle with all the new
	 * information.  At the same time, save away all the necessary
	 * information for freeing up the old resources
	 */
	old_srqinfo	   = srq->srq_wqinfo;
	old_mtt		   = srq->srq_mrhdl->mr_mttrsrcp;
	bcopy(&srq->srq_mrhdl->mr_bindinfo, &old_bind,
	    sizeof (mcxnex_bind_info_t));

	/* Now set the new info */
	srq->srq_wqinfo	   = new_srqinfo;
	srq->srq_wq_buf	   = buf;
	srq->srq_wq_bufsz  = (1 << log_srq_size);
	bcopy(&bind, &srq->srq_mrhdl->mr_bindinfo, sizeof (mcxnex_bind_info_t));
	srq->srq_mrhdl->mr_mttrsrcp = mtt;
	srq->srq_desc_off  = srq_desc_off;
	srq->srq_real_sizes.srq_wr_sz = (1 << log_srq_size);

	/* Update MR mtt pagesize */
	mr->mr_logmttpgsz = mtt_pgsize_bits;
	mutex_exit(&mr->mr_lock);

	/*
	 * Initialize new wridlist, if needed.
	 *
	 * If a wridlist already is setup on an SRQ (the QP associated with an
	 * SRQ has moved "from_reset") then we must update this wridlist based
	 * on the new SRQ size.  We allocate the new size of Work Request ID
	 * Entries, copy over the old entries to the new list, and
	 * re-initialize the srq wridlist in non-umap case
	 */
	wre_old = srq->srq_wq_wqhdr->wq_wrid;

	bcopy(wre_old, wre_new, srq_old_bufsz * sizeof (uint64_t));

	/* Setup new sizes in wre */
	srq->srq_wq_wqhdr->wq_wrid = wre_new;

	/*
	 * If "old" SRQ was a user-mappable SRQ that is currently mmap()'d out
	 * to a user process, then we need to call devmap_devmem_remap() to
	 * invalidate the mapping to the SRQ memory.  We also need to
	 * invalidate the SRQ tracking information for the user mapping.
	 *
	 * Note: On failure, the remap really shouldn't ever happen.  So, if it
	 * does, it is an indication that something has gone seriously wrong.
	 * So we print a warning message and return error (knowing, of course,
	 * that the "old" SRQ memory will be leaked)
	 */
	if ((srq->srq_is_umap) && (srq->srq_umap_dhp != NULL)) {
		maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
		status = devmap_devmem_remap(srq->srq_umap_dhp,
		    state->hs_dip, 0, 0, srq->srq_wqinfo.qa_size, maxprot,
		    DEVMAP_MAPPING_INVALID, NULL);
		if (status != DDI_SUCCESS) {
			mutex_exit(&srq->srq_lock);
			MCXNEX_WARNING(state, "failed in SRQ memory "
			    "devmap_devmem_remap()");
			/* We can, however, free the memory for old wre */
			kmem_free(wre_old, srq_old_bufsz * sizeof (uint64_t));
			return (DDI_FAILURE);
		}
		srq->srq_umap_dhp = (devmap_cookie_t)NULL;
	}

	/*
	 * Drop the SRQ lock now.  The only thing left to do is to free up
	 * the old resources.
	 */
	mutex_exit(&srq->srq_lock);

	/*
	 * Unbind the MTT entries.
	 */
	status = mcxnex_mr_mtt_unbind(state, &old_bind, old_mtt);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to unbind old SRQ memory");
		status = DDI_FAILURE;
		goto srqmodify_fail;
	}

	/* Free the memory for old wre */
	kmem_free(wre_old, srq_old_bufsz * sizeof (uint64_t));

	/* Free the memory for the old SRQ */
	mcxnex_queue_free(&old_srqinfo);

	/*
	 * Fill in the return arguments (if necessary).  This includes the
	 * real new completion queue size.
	 */
	if (real_size != NULL) {
		*real_size = (1 << log_srq_size);
	}

	return (DDI_SUCCESS);

srqmodify_fail:
	return (status);
}


/*
 * mcxnex_srq_refcnt_inc()
 *    Context: Can be called from interrupt or base context.
 */
void
mcxnex_srq_refcnt_inc(mcxnex_srqhdl_t srq)
{
	mutex_enter(&srq->srq_lock);
	srq->srq_refcnt++;
	mutex_exit(&srq->srq_lock);
}


/*
 * mcxnex_srq_refcnt_dec()
 *    Context: Can be called from interrupt or base context.
 */
void
mcxnex_srq_refcnt_dec(mcxnex_srqhdl_t srq)
{
	mutex_enter(&srq->srq_lock);
	srq->srq_refcnt--;
	mutex_exit(&srq->srq_lock);
}


/*
 * mcxnex_srqhdl_from_srqnum()
 *    Context: Can be called from interrupt or base context.
 *
 *    This routine is important because changing the unconstrained
 *    portion of the SRQ number is critical to the detection of a
 *    potential race condition in the SRQ handler code (i.e. the case
 *    where a SRQ is freed and alloc'd again before an event for the
 *    "old" SRQ can be handled).
 *
 *    While this is not a perfect solution (not sure that one exists)
 *    it does help to mitigate the chance that this race condition will
 *    cause us to deliver a "stale" event to the new SRQ owner.  Note:
 *    this solution does not scale well because the number of constrained
 *    bits increases (and, hence, the number of unconstrained bits
 *    decreases) as the number of supported SRQ grows.  For small and
 *    intermediate values, it should hopefully provide sufficient
 *    protection.
 */
mcxnex_srqhdl_t
mcxnex_srqhdl_from_srqnum(mcxnex_state_t *state, uint_t srqnum)
{
	uint_t	srqindx, srqmask;

	/* Calculate the SRQ table index from the srqnum */
	srqmask = (1 << state->hs_cfg_profile->cp_log_num_srq) - 1;
	srqindx = srqnum & srqmask;
	return (state->hs_srqhdl[srqindx]);
}


/*
 * mcxnex_srq_sgl_to_logwqesz()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_srq_sgl_to_logwqesz(mcxnex_state_t *state, uint_t num_sgl,
    mcxnex_qp_wq_type_t wq_type, uint_t *logwqesz, uint_t *max_sgl)
{
	uint_t	max_size, log2, actual_sgl;

	switch (wq_type) {
	case MCXNEX_QP_WQ_TYPE_RECVQ:
		/*
		 * Use requested maximum SGL to calculate max descriptor size
		 * (while guaranteeing that the descriptor size is a
		 * power-of-2 cachelines).
		 */
		max_size = (MCXNEX_QP_WQE_MLX_SRQ_HDRS + (num_sgl << 4));
		log2 = highbit(max_size);
		if ((max_size & (max_size - 1)) == 0) {
			log2 = log2 - 1;
		}

		/* Make sure descriptor is at least the minimum size */
		log2 = max(log2, MCXNEX_QP_WQE_LOG_MINIMUM);

		/* Calculate actual number of SGL (given WQE size) */
		actual_sgl = ((1 << log2) - MCXNEX_QP_WQE_MLX_SRQ_HDRS) >> 4;
		break;

	default:
		MCXNEX_WARNING(state, "unexpected work queue type");
		break;
	}

	/* Fill in the return values */
	*logwqesz = log2;
	*max_sgl  = min(state->hs_cfg_profile->cp_srq_max_sgl, actual_sgl);
}
